src/main/resources/soap/soapMessage.ftl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.nl.ilionx.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:doSomething>
            <value>${valueForTemplate}</value>
        </soap:doSomething>
    </soapenv:Body>
</soapenv:Envelope>